# BoundaryYTranslationFixed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BoundaryYTranslationFixed Property
ParameterTypeId Class See Also
---
"Y Translation - Fixed"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BoundaryYTranslationFixed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BoundaryYTranslationFixed As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BoundaryYTranslationFixed {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace